app/views/messages/_form.html.erb

SELECT "messages".* FROM "messages"
---
      <ul>
        <% @message.errors.full_messages.each do |full_message| %>