app/controllers/messages_controller.rb

  def index
    @message = Message.new
    # Messageを全て取得する
    @messages = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    @message = Message.new(message_params)
    if @message.save
---
INSERT INTO "messages" ("name", "body", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "林"], ["body", "テスト"], ["age", 33], ["created_at", "2016-01-04 13:43:23.027667"], ["updated_at", "2016-01-04 13:43:23.027667"]]